# Welcome to intro to pandas

* import pandas

In [2]:
import pandas as pd

In [38]:
import numpy as np

* create python dictionary

In [4]:
dict = {"col1":[1,2], "col2":[2,3] }

* Show created dictionary in the form of rows and column using DataFrame of pandas

In [35]:
Darry =pd.DataFrame(dict)

In [36]:
Darry

   col1  col2
0     1     2
1     2     3

In [37]:
Darry.dtypes

col1    int64
col2    int64
dtype: object

* data as a constant

In [27]:
cnst = {"col1":1, "col2":2, "col3 ": [1,34]}

* add custom indexes

In [30]:
constDf = pd.DataFrame(cnst, index = ["a","b"])

In [31]:
constDf

   col1  col2  col3
a     1     2      1
b     1     2     34

In [33]:
constDf.dtypes

col1     int64
col2     int64
col3     int64
dtype: object

In [6]:
table = pd.DataFrame(dict, index = ["first", "second"])

In [7]:
table

        col1  col2
first      1     2
second     2     3

In [32]:
table.dtypes

col1    int64
col2    int64
dtype: object

* data frame from numpy array

In [40]:
num_ar = np.array([[1,2,3],[2,4,5], [5,7,8]])

In [42]:
NpDf = pd.DataFrame(num_ar)

In [44]:
NpDf

   0  1  2
0  1  2  3
1  2  4  5
2  5  7  8

* add custum column

In [46]:
npDf = pd.DataFrame(num_ar, columns = ["col1", "col2", "col3"])

In [48]:
npDf

   col1  col2  col3
0     1     2     3
1     2     4     5
2     5     7     8

In [50]:
npDf.dtypes

col1    int32
col2    int32
col3    int32
dtype: object

In [52]:
npDf.size

9

In [54]:
npDf.shape

(3, 3)

In [57]:
npDf.values

array([[1, 2, 3],
       [2, 4, 5],
       [5, 7, 8]])

In [59]:
npDf.style

In [61]:
npDf.ndim

2

# get and set  specified row/column pair

 * get/access

In [62]:
df = npDf

In [64]:
df

   col1  col2  col3
0     1     2     3
1     2     4     5
2     5     7     8

In [66]:
df.iat[2,0]

5

 * set

In [67]:
df.iat[2,0] = 23

In [69]:
df

   col1  col2  col3
0     1     2     3
1     2     4     5
2    23     7     8

* CURD csv

In [72]:
df = pd.DataFrame({
    "name": ["Kishore", "dileep", "Ali"],
    "marks":[12,34,56]
})

In [74]:
df

      name  marks
0  Kishore     12
1   dileep     34
2      Ali     56

In [76]:
df.to_csv(index = False)

'name,marks\r\nKishore,12\r\ndileep,34\r\nAli,56\r\n'

In [78]:
df.to_csv("out.csv")

In [81]:
df.to_excel("sheet1.xlsx", sheet_name = "new1")

In [6]:
dictExp = {"experience": [ 1.1,
1.3,
1.5,
2.0,
2.2,2.9,
3.0,
3.2,
3.2,
3.7,
3.9,
4.0,
4.0,
4.1,
4.5,
4.9,
5.1,
5.3,
5.9,
6.0,
6.8,
7.1,
7.9,
8.2,
8.7,9.0,
9.5,
9.6,
10.3,
10.5,],"salary":[39343.00
,46205.00
,37731.00
,43525.00
,39891.00
,56642.00
,60150.00
,54445.00
,64445.00
,57189.00
,63218.00
,55794.00
,56957.00
,57081.00
,61111.00
,67938.00
,66029.00
,83088.00
,81363.00
,93940.00
,91738.00
,98273.00
,101302.00
,113812.00
,109431.00
,105582.00
,116969.00
,112635.00
,122391.00
,5121872.00]}

In [8]:
TData = pd.DataFrame(dictExp)

In [9]:
TData

    experience     salary
0          1.1    39343.0
1          1.3    46205.0
2          1.5    37731.0
3          2.0    43525.0
4          2.2    39891.0
5          2.9    56642.0
6          3.0    60150.0
7          3.2    54445.0
8          3.2    64445.0
9          3.7    57189.0
10         3.9    63218.0
11         4.0    55794.0
12         4.0    56957.0
13         4.1    57081.0
14         4.5    61111.0
15         4.9    67938.0
16         5.1    66029.0
17         5.3    83088.0
18         5.9    81363.0
19         6.0    93940.0
20         6.8    91738.0
21         7.1    98273.0
22         7.9   101302.0
23         8.2   113812.0
24         8.7   109431.0
25         9.0   105582.0
26         9.5   116969.0
27         9.6   112635.0
28        10.3   122391.0
29        10.5  5121872.0

In [10]:
TData['experience']

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: experience, dtype: float64

In [11]:
TData["salary"]

0       39343.0
1       46205.0
2       37731.0
3       43525.0
4       39891.0
5       56642.0
6       60150.0
7       54445.0
8       64445.0
9       57189.0
10      63218.0
11      55794.0
12      56957.0
13      57081.0
14      61111.0
15      67938.0
16      66029.0
17      83088.0
18      81363.0
19      93940.0
20      91738.0
21      98273.0
22     101302.0
23     113812.0
24     109431.0
25     105582.0
26     116969.0
27     112635.0
28     122391.0
29    5121872.0
Name: salary, dtype: float64